app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY "movies"."release_date" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY "movies"."title" ASC
---
  def index
    path_info = request.env['PATH_INFO']

    # Clear the sessiom if no query params are passed as part of the get request.
    if path_info == '/'
      session.clear
    end

    @allRatings = Movie.all_ratings

    check_Rating_Param = (params[:ratings].nil?)
    check_Sessions_Param = (session[:ratings_to_show].nil? )
    rates = check_Rating_Param ? ( check_Sessions_Param ?
                            @allRatings : JSON.parse(session[:ratings_to_show])) : params[:ratings].keys

    if params[:sort]
      session[:sort] = params[:sort]
      sort = params[:sort]
    elsif session[:sort]
      sort = session[:sort]
    end

    @ratings_to_show = rates


    if (sort == "release_date")
      @movies = Movie.with_ratings(rates).order(:release_date)

    elsif (sort == "title")
      @movies = Movie.with_ratings(rates).order(:title)