app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @temp = params[:sort].to_s
    @class_name = 'hilite'
    if @temp == 'release_date'
      @movies = Movie.all.order(params[:sort])